LaminarVortexSheddingInOpenFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;  // opt icoFoam simpleFoam pisoFoam pimpleFoam

startFrom       latestTime;  // opt: firstTime startTime latesTime

startTime       0;           // opt: 0 

stopAt          endTime;     // opt: endTime writeNow noWriteNow nextWrite

endTime         200;

deltaT          0.002;

writeControl    timeStep; // opt: timeStep runTime adjustableRunTime cpuTime clockTime

writeInterval   20;

purgeWrite      0; // opt: overwrites directories to limit number of time directories. 0 = no overwriting 

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.3;

// ************************************************************************* //

// ************************************************************************* //
functions
{
  
forces
{
    type                forces;
    functionObjectLibs  ("libforces.so");
    outputControl       timeStep;
    outputInterval      10;
     
    patches             ( "cylinderWalls" );
    pName               p;
    UName               U;
    rhoName             rhoInf;
    log                 true; 
    CofR                (0 0 0);     
    rhoInf              1.00;
}
 
 
forceCoeffs
{
    type                forceCoeffs;
    functionObjectLibs  ( "libforces.so" );
    outputControl       timeStep;
    outputInterval      10;
 
    patches             ( "cylinderWalls" );
    pName               p;
    UName               U;
    rhoName             rhoInf;
    log                 true;
    rhoInf              1.00;
     
    liftDir             (0 1 0);
    dragDir             (1 0 0);
    CofR                (0 0 0);
    pitchAxis           (0 0 1);
     
    magUInf             1;
    rhoInf              1.00;
    lRef                1;
    Aref                1;
}

}
